Repository: mozilla-l10n/mt-training-data
Catalog: kvx/kvx_pontoon.tmx
Source language: en_us
Languages: kvx

source: Tatoeba is a large database of sentences, translations, and spoken audio for use in language learning. This download contains spoken English recorded by their community.
kvx: ٽيٽوئي با هيڪ موٽو ڊيٽا سيٽ سئہ جيو جُملون،ترجمون، ان ٻولئي ڳئي آڊيو مانه مُشتمِل سئہ۔ جئي ٻولئي شِينکيا ۿارُو اِستعمال ڪرئي زائي هيڪئہ۔ اي ڊائونلوڊ اُوئا رِي قوم رئي ريڪارڊ ڪرل ٻولئي انگريزِي مانه مبني سئہ۔

source: Technology and Robotics
kvx: ٽيڪنالاجِي انَ روبوٽِيڪس

source: Technology that speaks your language
kvx: ايوَئي ٽيڪنالاجِي جيو تمارِي ٻولِي نئہ ۿزمئہ انَ اُوئا ۾ وات پڻ ڪرئہ

source: TED-LIUM Corpus
kvx: هيڪ ڊيٽاسيٽ وات چيت سئہ جئي ٽِي اِي ڊِي ماٿئہ مُشتمِل سئہ

source: Teke
kvx: ٽيڪي

source: Tell us what you'd like to download:
kvx: ڪِي تمي ۿمڀۯاوي هيڪو جي تمي ڪِي ڊائونلوڊ ڪروا ڪروه:

source: Telugu
kvx: ٽيگلُو

source: Tepeuxila Cuicatec
kvx: ٽيپِيُوايگزِيلا ڪُوئيڪيٽِيڪ

source: Terms
kvx: شرطون

source: <termsLink>Terms</termsLink>
kvx: <termsLink>شرطون/قائيڌا</termsLink>

source: Teutila Cuicatec
kvx: ٽِيُوٽِيلا ڪُوئيڪيٽِڪ

source: Thai
kvx: ٿائِي

source: Thanks for confirming your account, now let's build your profile.
kvx: تمارا اڪائونٽ نئہ پڪو ڪريا ۿارُو تمارئي ميرڀونئي،هوَئہ هالو هالينَ آپرئي پروفائل ٺاوون۔

source: Thanks to contributions from over 259k people in over 50 languages, this data is being used to train speech-enabled applications to better respond to the human voice.
kvx: 259 هزار منکون ٿِي وڌارئہ حصو انَ 50 ٿِي وڌِيڪ ٻوليون رئي ميرڀونئي، اي ڊيٽا ٻوليا ۿارُو شُروع ڌرخواستون نئہ شِينکاڙيا اِستعمال ٿئه ريو زم اِنسون رِي آواز رو ٺائُوڪئہ نمُونئہ جواڀ ۮِيڌو زائہ۔

source: Thank you for contributing to Spontaneous Speech!
kvx: يڪڌم ٻولِيا ۾ حصو ليڌا ۿارُو ميرڀونئي!

source: Thank you for contributing your bulk submission!
kvx: تمارئي جمع ڪرَل جانڪارئِي ۮِيڌا ۿارُو ميرڀونئي!

source: Thank you for contributing your voice!
kvx: تمارِي آواز ۾ ڀاڳ لِيڌا ۿارُو ميرڀونئي۔

source: Thank you for donating your voice clips!
kvx: تمارِي آواز را ڪِلپ ۮِيڌا ۿارُو ميرڀونئي

source: Thank you for recording!<lineBreak></lineBreak>Now review and submit your clips below.
kvx: رِيڪارڊِنگ ڪريا ۿارُو ميرڀونئي <lineBreak></lineBreak> هوَئہ تمي تمارا ڪِلپ رو جائزو ليو انَ نِيسو جمع ڪراوَو۔

source: Thank you for your information
kvx: تماري جانڪارِي رئي ميرڀون

source: Thank you for your interest in contributing to { $lang }. We work hard to get every language ready for launch and keep the teams updated via email. If you want to contribute, please provide your email below.
kvx: تمارو{ $lang }۾ حِصو لِيڌا ۿارُو جوم جوم ميرڀونئي۔ امي هر هيڪ ٻولِي رئي شُروئات ڪريا ۿارُو ڪرينَ تيار ڪريا ۾ مينت ڪرونه انَ ٽيمون نئہ اِيميل ري ذريعي اپ ڊيٽ راکون،جيڪيۮِي تمي حِصو ليوا ڪرو،تون ميرڀونئي ڪرينَ آپرو اِيميل نِيسو ۮيو۔

source: Thank you for your voice information
kvx: تمارِي آواز رِي معلُومات ۿارُو ميرڀونئي۔

source: Thank you! You’ve sent a new language enquiry
kvx: ميرڀونئي! تمي هيڪ نوِي ٻولِي را ڀارام جونچ ميلئي پرئي

source: The best sentences are natural and conversational — they should be easy for someone to read. While phonetic diversity and different words in sentences is important, we are also trying to make recording sentences as engaging and fun for our volunteer community as possible.
kvx: ٺائُوڪا جُملا اُو هوئہ جيو فِطرِي انَ وات چِيت ڪريا رئہ لائيق هوئہ—هائي ايوا هووو کپئہ جي ڪياڪ ۿارُو اُوئا نئہ ڀڻوو ۿورا هوئہ۔ آواز رئہ متعلِق اِختلاف انَ جمُلون ۾ ڌار ڌار آکر ضرُورِي سئہ، امي اي پڻ چاهون جي ريڪارڊِنگ را جُملا امارِي رضاڪار نات ۿارُو ڌيونَ طلب انَ مزيڌار هوئہ۔

source: The best sentences for building a useful speech recognition engine are colloquial, modern parlance. Some ideas to help you generate sentences are;
kvx: ٺائوڪئي ٻولِي را اوۯکوڻ را اِنجڻ ٺايا ۿارُو ٺائُوڪا جُملا اُو هوئہ جو هر روز ٻوليا واۯئي ٻولئي انَ نوا لهجا ۾ هوئہ۔ ڪينئڪ جُملا جيا تمون جُملا ٺايا ۾ مڌت ڪري هيڪئہ اُو اي سئہ؛

source: The bumblebee sped by.
kvx: ڀمري تيزِي ٿِي مٽي ڳي۔

source: The Clip Graveyard consists of voice clips that didn't make it into the Common Voice dataset. Just like the dataset, the Clip Graveyard is available for download. We would like to thank the following people and organizations for their help with the project:
kvx: ڪِلپ قبرستانون را اُوئا آواز مانه اُوڀل سئہ جيا ڪومنَ وائيس ڊيٽا ڀيس ۾ شامل نہ ٿي هيڪيا۔ ۿاو ڊيٽا سيٽ را زم، ڪِلپ قبرستان پڻ ڊائون لوڊ ۿارُو تيار سئہ۔ امي هيٺ ۮِيڌل ادارون واۯون رئي انَ منکون رئي ميرڀونئي ڪرونه جينہ امارئي اِيئا پروجيڪٽ ۾ مڌت ڪرئي:

source: The clip has disrespectful or offensive language.
kvx: ڪِلپ ۾ نا مُناسِب ڪا بي ادبي ٻولئي سئہ۔

source: The Common Voice Dataset contains hundreds of thousands of voice samples that help developers build voice recognition tools.
kvx: ڪومنَ ڊيٽا وائيس ۾ هزارون رِي تعداد ۾ آوازون را نمُونا هوئہ جيا ٻولِي رِي ترقِي ۿارُو مڌت گار سئہ۔

source: The community is the beating heart of Common Voice - they come from all over the world, and are language activists and scientists and artists. You can learn more about how to get involved on our <about>About</about> page and in our <community>Community playbook</community>. If you're interested in deeper organisational partnership, <emailFragment>get in touch.</emailFragment>
kvx: قوم ڪومنَ وائيس رو دل سئہ-هائي پُورِي ڌُنيا ٿِي آوئہ، انَ هائي ٻولِي مانه ڪوم ڪريا واۯا،سائينسڌان ان آرٽسٽس سئہ۔تمي امارِي<about>ڀارام</about>پونيا مانه انَ امارِي<community>قوم پلي بُڪ</community>۔۾ شامِل ٿيا را طرِيقا را ڀارام گھڻا زوڻي هيڪو جيڪيۮِي تمي جوم گهرا اِراڌا ٿِي حِصو لِيڌا ۾ ڌلچسپئي راکو تون،</emailFragment> راڀطو ڪرو۔

source: The content contains a language different than I was expecting.
kvx: اِيئا مضمُونَ ۾ اُو ٻولئي سئہ جيو مارِي اُميڌ پرموڻئہ نٿِي۔

source: The content has disrespectful or offensive language.
kvx: اِيئا مضمُون ۾ ڀي اڌڀي انَ کراٻ ٻولئي اِستعمال ڪرئي ڳئي۔

source: The giant dino [cough] the Triassic.
kvx: [گيانٽ] ڊائينا رئي [ڌونه] ٽِرياسِڪ۔

source: The giant dinosaur of the Triassic.
kvx: Triassic را موٽا dinosaurs۔

source: The giant dinosaurs of the Triassi-.
kvx: Triassic را الهائِي موٽا dinosaurs۔

source: The giant dinosaurs of the Triassic.
kvx: Triassic را الهائِي موٽا dinosaurs۔

source: The giant dinosaurs of the Triassic. [read by one voice]
kvx: ٽِرياسِيڪ را موٽا ڊائناسور۔ [هيڪ ئي آواز ۾ ڀڻيو ڳيو]

source: The giant dinosaurs of the Triassic. <strong>[read by one voice]</strong>
kvx: The giant dinosaurs of the Triassic.<strong> هيڪِي آواز ۾ ڀڻيو ڳيو </strong>

source: The giant dinosaurs of the Triassic. Yes.
kvx: Triassic را الهائِي موٽا dinosaurs۔ هووَئہ۔

source: The giant dino <strong>[cough]</strong> the Triassic.
kvx: الهائِي موٽا dino<strong>ڌونه</strong>Triassic.

source: The MediaRecorder API is not supported in your browser.
kvx: تمارا ڀرائُوزر ۾ ميڊيا ريِڪارنگ اي پي آئِي مڌت نٿِي ڪرتو۔

source: The number of recordings and which languages you contribute to will be public.
kvx: تمارا رِيڪارڊِنگ رئي تعڌاڌ انَ جئي ٻولِي ۾ تمي حِصو لِيڌو اُو عام منکون ۿارُو موجوڌ هوشي۔

source: The page you are looking for could not be found
kvx: جيو پونيو تمي ڳوتو ريا، اُو نٿِي زۯي هيڪيو

source: The question should be answerable in just a couple of sentences.
kvx: سوئال رو جواڀ رُوڳو ٻي ٿِي ترڻ جُملون ۾ ۮِيڌو زائہ هيڪئ﻿ہ۔

source: There are currently no prompts for this language. Please refresh the page or try again later.
kvx: ايئا ٽوڻا ۾ ايئا ٻولِي ۿارُو ڪوئي آڊيو موجوڌ نٿِي۔ ميرڀونئي ڪرينَ پونيو نوو ڪرو ڪا ٻِيزي وار ڪوشيش ڪرو۔

source: There are currently no prompts to validate for this language. Please refresh the page or try again later.
kvx: اِيئا ٽوڻا ۾ اِيئا ٻولِي ۿارُو ڪوئي آڊيو موجوڌ نٿِي۔ ميرڀونئي ڪرينَ پونيو نوو ڪرو ڪا ٻِيزي وار ڪوشيش ڪرو۔

source: There are currently no sentences to review in this language.
kvx: همڻئہ اِيئا ٻولِي ۾ زويا ۿارُو ڪوئي جُملا موجود نٿِي۔

source: There are currently no transcriptions to check for this language. Please refresh the page or try again later.
kvx: فِي الحال اِيئا ٻولِي رِي لکائِي نئہ چيڪ ڪروو ضرُورِي نٿِي۔ميرڀونئي ڪرينَ پونيا نئہ ٻِيزِي وار تازو ڪرو ڪا وۯي ٻِيز وار ڪوشش ڪرو۔

source: There are lots of ways to think about language. For the purposes of speech recognition models, Common Voice suggests focussing on ‘mutual intelligibility’, or ‘can speakers of this language mostly understand one another if they try to?’
kvx: ٻولِي نئہ ۿزميا را جوم طرِيقا سئہ۔ زم ٻولئي زوڻ را نمُونا ۿارُو، ڪومنَ وائيس اي صلاح ۮئه جي مطابدلا ۿزميا رئي صلاحيت مانه ڌيونَ ۮِيڌو ﻿زائہ۔ — مطلٻ ڪِي هائي ٻولئي ٻوليا واۯا گھڻو ڪرينَ هيڪا ٻِيزا نئہ ۿزمي هيڪئہ جي اُو ڪوشش ڪرئہ؟

source: The recording was too long.
kvx: رِيڪارڊِِنگ جوم لون﻿ٻئي هتئي

source: The recording was too quiet.
kvx: رِيڪارڊِنگ جوم شونت هتئي

source: The recording was too short.
kvx: رِيڪارڊِنگ الهائِي ننڪئي هتئي

source: There is currently no audio to transcribe for this language. Please refresh the page or try again later.
kvx: ايئا ٽوڻا ۾ ايئا ٻولِي ۿارُو ڪوئي آڊيو موجوڌ نٿِي۔ ميرڀونئي ڪرينَ پونيو نوو ڪرو ڪا ٻِيزي وار ڪوشيش ڪرو۔

source: There should ideally be no digits in the source text because they can cause problems when read aloud. The way a number is read depends on context and might introduce confusion in the dataset. For example, the number “2409” could be accurately read as both “twenty-four zero nine” and “two thousand four hundred nine”.
kvx: ٺائُوڪو اي سئہ جي متن را ذريعا ۾ ڪوئي نمڀر نہ هوئہ، ڪم تون اُوئون نئہ 0 ٿِي ڀڻيا ۾ مسئلا پيش ٿي هيڪئہ۔ ڪياڪ نمڀر نئہ ڪيوَئہ نمُونئہ ڀڻوو، اي مضمون مانه مبني هوئہ انَ اي ڊيٽاسيٽ ۾ اُلجهن پيڌا ڪري هيڪئہ مثال را طور مانه، نمڀر“2409”نئہ “ٽوئينٽِي فور زِيرو نائن” انَ “ٻي هزار چار ۿو نوَ” ٻئيون طرِيقون ٿِي ڀڻيو زائي هيڪئہ”۔

source: There will be natural variations in volume between readers. Reject only if the volume is so high that the recording breaks up, or (more commonly) if it is so low that you can’t hear what is being said without reference to the written text.
kvx: ڀڻيا واۯون رِي آواز ۾ قُڌرتِي لحاظ ٿِي ڦرق هوشي۔ رُوڳو اُوئہ ٽوڻئہ رد ڪرو زئيون آواز الهائِي اُوتومڻئي هوئہ انَ رِيڪارڊنگ سهِي نہ ٿيتئي هوئہ، ڪا (گھڻو ڪرينَ) جيڪيۮِي اتئي هڻيون هوئہ جي تمي ۿومڀۯي نہ هيڪو جي ڪِي ڪِيڌو زائه ريو زئيون ۿُوڌِي لکل متنَ تمون ۿومو نہ هوئہ۔

source: The route was unclear.
kvx: رستو صاڦ نٿِي۔

source: These languages are currently under community development. <localizationGlossaryLink>Website localization</localizationGlossaryLink> and <sentenceCollectionGlossaryLink>sentence collection</sentenceCollectionGlossaryLink> is needed to launch.
kvx: اي ٻولي همڻئہ نات رِي ترقِي هيٺ سئہ۔<localizationGlossaryLink>ويب سائيٽ مقامِي رُجحان پرموڻئہ نوکوو</localizationGlossaryLink> انَ<sentenceCollectionGlossaryLink>جُملا ڀيۯا</sentenceCollectionGlossaryLink> ڪريا رئي ضرُورت سئہ زم اُوئون نئہ تيار ڪرينَ اُوئون رئي شرُوعات ڪرئي زائہ۔

source: The selected file is too large
kvx: سُونڍل فائل رو سائز جوم موٽو سئہ

source: The Sentence Collector is moving to the core Common Voice platform. You can now <writeURL>write</writeURL> a sentence or <reviewURL>review</reviewURL> single sentence submissions on Common Voice.
kvx: Sentence Collector هوَئہ مرڪزِي Common Voice platform مانه منتقِل ٿئه ريو۔ هوَئہ تمي <writeURL> لکو</writeURL> جُملو ڪا <reviewURL> دوهرائِي</reviewURL> Common Voice مانه هيڪ هيڪ جمع ڪري هيڪو۔

source: The sentence has a grammatical or spelling error.
kvx: جُملا ۾ گرامر ڪا لکت ۾ ڳلتئي سئہ۔

source: The sentence has disrespectful or offensive language.
kvx: جُملا ۾ بي ادب ڪا نا مُناسِب ويڻ سئہ۔

source: The sentence must be grammatically correct.
kvx: جُملو گرامر لا لحاظ ٿِي پڻ ٺِيڪ هوئہ۔

source: The sentence must be speakable.
kvx: جُملو ايوو هوئہ جو ۿورئہ نمُونئہ ﻿ٻولي هيڪئہ۔

source: The sentence must be spelled correctly.
kvx: جُملو سهِي ﻿اِمل﻿﻿ا ٿِي لِکل هوئہ۔

source: The sentence should have fewer than 15 words.
kvx: جُملا ۾ 15 ٿِي گھٽ آکر هووو کپئہ۔

source: The site is ready to be launched when it reaches 75% completion.
kvx: زئيون سائيٽ رو ڪوم 75% پ﻿ُورو ٿي زائه، تون اُوئا نئہ شُروع ڪريا ۿارُو تيار ۿزميو زائه۔

source: The site will be back up as soon as possible. For the latest information, please join the <matrixLink>Matrix community chat</matrixLink> or visit <githubLink>GitHub</githubLink> or <discourseLink>our Discourse forums</discourseLink> to submit and monitor site experience issues.
kvx: سائيٽ جلڌ ٿِي جلڌ وۯي ڪوم ڪروا شُروع ڪرشي پرو۔ نوِي جانڪارِي ﻿ۿارُو، ميرڀونئي ڪرينَ<matrixLink>ميٽرِڪس ڪميونٽِي چيٽ</matrixLink>ڪا جائزو<githubLink>گِٽ هِب</githubLink>ڪا<discourseLink>امارا ڊِسڪورس فارم</discourseLink>مانه زائين تجرڀا را مسئلا ۿمڀۯاوو انَ زوئو۔

source: The TED-LIUM corpus was made from audio talks and their transcriptions available on the TED website.
kvx: ٽِي اِي ڊِي-لِيئم ڪارپس اُوئا آڊيو ٽاڪس ٿِي تيار ڪريو ڳيو جيو ٽِي اِي ڊِي ويب سائيٽ مانه ڌستياڀ سئہ۔

source: The website text is translated into that language.
kvx: ويب سائيٽ رو ترجمو اُوئا ٻولِي ۾ ڪريو زائه۔

source: This content contains personally identifiable information related to an individual's identity, such as their name, email address, location, identification number, or phone number.
kvx: اِيئا مضمُونَ ۾ ڪياڪ منک رِي اوۯکوڻ ڀيۯئي ذاتِي جانڪارئي شامِل سئہ،زم اُوئا رو نوم،اِيميل ايڊريس،لوڪيشن،شناختي ڪارڊ نمڀر، ڪا فون نمڀر۔

source: This content is asking for personally identifiable information related to an individual's identity, such as their name, email address, location, identification number, or phone number.
kvx: اي مضمُون ڪياڪ ذاتِي منک رِي اوۯکوڻ را ڀارام جانڪارئي موڳئه ريو زم اُوئا رو نوم،اِيميل ايڊريس،لوڪيشن،شناختي ڪارڊ نمڀر، ڪا فون نمڀر۔

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex.
kvx: اي معلُومات ۮيوو مرضِي مانه سئہ۔ تمي رُوڳو تئيون ۿمڀۯاوو زئيون تمون نئہ ٺِيڪ لاڳئہ۔ زئيون امي ڊيٽا سيٽ جارِي راکون، تون ﻿امي ٻڌِي ذاتِي معلُومات نئہ پسيُوڊونِيمائِيس ڪرونه، انَ اِيئا وات رئِي پڪ ڪرون جي تمارو نوم انَ اِي ميل جيوَئي تفصِيلات تمارِي عُمر ڪا جِنس رِي معلُومات ٿِي نہ جُڙل هوئہ۔

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex. For technology to work well for everyone, the data that helps developers to build technology needs to reflect a diverse range of people. Learn more about why metadata matters.
kvx: اي جانڪارئي ۮيڌا رئي اکتياري سئہ-تمي رُوڳو تئيون نوکو زئيون تمون نئہ اي ۿورو لاڳئہ۔ زئيون امي ڊيٽا سيٽ جاري ڪرشون، تئيون ٻڌي ذاتِي جانڪارِي نئہ ڀڌلشون پرئي،ان اي يقين ۮيوراشون جي تمارو نوم اِيميل ۾ غير حقيقي جانڪارئي زم زمار ڪا جنس ٿِي لاڳا پيل نہ هوئہ۔ زم هر هيڪ منک ۿارُو ٺائوڪو ڪوم ڪري هيڪئہ، تيا ۿارُو هائي ڊيٽا تحقيق ٽيڪنلوجي ٺاها واۯا رئي مڌت ڪري هيڪئہ، اُو ڌار ڌار منکون نئہ ۮيکاڙوو ضروري سئہ۔ ڌاخل ٿيل جانڪارِي ري اهميت را ڀارام وڌيڪ جانڪارئي ليو۔

source: This is a use case driven segment containing data to power spoken digit recognition and yes / no detection.
kvx: اي هيڪ اِستعمال ڪرل ڊرائيونَ سيگمينٽ سئہ جيو ٻوليا واۯا ۿارُو ان نہ اوۯکوڻ ۮِيڌا واۯا نئہ طاقت ۮِيڌا ۿارُو ڊيٽا مانه مُشتمِل سئہ۔

source: This is how you cite yourself if you wrote the content yourself.
kvx: اي طرِيقو سئہ جي تمي آپ مضمُونَ لکيو هوئہ تون آپرا آپ رو حوالو ۮيو۔

source: This project would not be possible without people like you. 🎉 There are many ways to get involved with Common Voice - you don't have to know how to code to contribute!
kvx: اي پروجيڪٽ تمون جيوون منکون شوا مُمڪِن نٿِي ٿيتو۔ڪومنَ وائيس ۾ شامِل ٿيا را الهائِي طرِيقا سئہ-تمارئہ اِيئا ۾ شامِل ٿيا ۿارُو سافٽ ويئر را ڀارام زوڻوو ضرُورِي نٿِي!

source: This setting controls your leaderboard visibility. When hidden, your progress will be private. This means your image, user name and progress will not appear on the leaderboard. Note that leaderboard refresh takes ~{ $minutes }min to populate changes.
kvx: اي سيٽنگ تمارا ليڊر بورڊ را ڪوم نئہ ۮيکاڙ، ڪنٽرول ڪرئہ۔ زئيون اِيئا رئي ڇپائِي ٿئہ، تمارئي ترقئي ۿتاڙل ريشي۔ اِيئا مظلٻ اي سئہ جي تمارئي ڦوٽُو، استمعال ڪريا رو نوم اور ترقِي رئي رپورٽ لِيڊر بورڊ نئين ۮيکاڙئہ۔ ياڌ راکو جي لِيڊر بورڊ ڪا نوو { $minutes } مشهُور ٿيا ۾ ڀڌلاوَ لاڳئہ

source: Three to go!
kvx: باقِي ترڻ ري ﻿ڳيا

source: Thur
kvx: ٿر

source: Tibetan
kvx: طِبطانَ

source: Tigre
kvx: ٽائيگر

source: Tigrinya
kvx: تِجرِنيا

source: Tlazoyaltepec Mixtec
kvx: تلازوئيلٽيپيڪ مڪسٽيڪ

source: Toba Qom
kvx: توبا قوم

source: To change or edit your email, send us an email to <emailFragment>commonvoice@mozilla.com</emailFragment>
kvx: آپرو اِيميل ڀڌليا ڪا ايڊِٽ ڪريا ۿارُو،امون نئہ اِيميل ڪرو<emailFragment>commonvoice@mozilla.com</emailFragment>

source: Today
kvx: آز

source: Today's Common Voice progress on clips recorded
kvx: آز ڪومنَ وائِيس ۾ ڪرل ريڪارڊِنگ رئي ترقئي

source: Today's Common Voice progress on clips validated
kvx: آز ڪومنَ وائِيس ۾ ڪرل تصڌِيق رئي ترقئي

source: Today's Progress
kvx: آز رئي ترقئي

source: Toki Pona
kvx: توڪِي پونا

source: To make it into the Common Voice dataset, a voice clip must be validated by two separate users.
kvx: ڪومنَ وائيس ڊيٽا سيٽ ۾ شامِل ٿيا ۿارُو، هيڪِي آواز رو ڪِلپ ٻي ڀڻيا واۯون رئي تصديق ٿيوو ضرُورِي سئہ۔

source: Too many files
kvx: الهائِي فائلون اپلوڊ ٿي ڳي

source: Top Contributors
kvx: موٽا حصيدار

source: Torwali
kvx: تورولِي

source: Total
kvx: ٻڌوئي

source: Total Approved
kvx: ٻڌائي منظُور

source: To the right we outline the benefits and clarify what information we make public. Use the links below to get started with a Common Voice account on your own device.
kvx: ۿاوَئہ پاهئہ امي ڦائيڌا ۿمڀۯاوون ان ايٿئہ واضح ڪرونه جي امي ڪيوئي جانڪارئي منکون ۿُوڌِي پُوڳاڙون۔ نِيسو ۮِيڌل لِنڪ رو اِستعمال ڪرينَ آپرا وائيس مانه ڪومنَ وائيس اڪائونٽ شرُوع ڪرو۔

source: Toward next goal
kvx: آڳۯليا مقصڌ ۿارُو

source: Track progress here and on your stats page.
kvx: ايٿئہ انَ آپرا اسٽيٽس پونيا مانه آپرئي ڪارڪردگئي ۮيکاڙو۔

source: Transcribe
kvx: متن ۾ ڀڌلاوو

source: Transcribe answers
kvx: جواڀون نئہ لکي ليو

source: Transcribe Audio
kvx: آڊيو نئہ لکيا رِي صُورت ۾ ڀڌلو

source: Transcribe audio recordings into text
kvx: آڊيو رِيڪارڊنگ را متنَ ۾ ٽرانسرائب ڪرو

source: Transcribe audio recordings in your language
kvx: audio recordings نئہ آپر﻿ِي ٻولِي ۾ Transcribe ڪرو

source: Transcribe Audio <small>(Coming soon)</small>
kvx: آڊيو نئہ لکو<small>(جلڌِي آوئه ريو)</small>

source: Transcript edited successfully
kvx: لکت نئہ ڪامياڀِي ٿِي ايڊِٽ ڪرئي ڳئي

source: Transcript skipped successfully
kvx: لکائِي نئہ ڪامياڀِي ٿِي ساڏي ۮِيڌو

source: Transcript submitted successfully
kvx: متن نئہ ڪامياٻئي ٿِي جمع ڪريو پرو۔

source: Transcript voted successfully
kvx: لِکائِي نئہ ڪامياڀِي ٿِي ووٽ ۮِيڌو ڳيو

source: Transgender
kvx: ڀڌلل جِنسون

source: <translateVideoLink>Watch our guide on how to use Pontoon.</translateVideoLink>
kvx: <translateVideoLink> پونٽُون رو اِستعمال ڪريا رو طريقو زوڻيا ۿارُو اماري جارِي ڪرل وڊيو﻿ز نئہ زوئو۔</translateVideoLink>

source: Translating the site
kvx: ويب سائيٽ رو ترجمو ڪروو

source: Translation is from English, but you can see <strong>Suggestions</strong> in other languages. Click the <strong>Profile</strong> icon, then <strong>Settings</strong> link and add any languages you speak. At the bottom right-hand corner will be a list of translations called <strong>Locales</strong>. Translations show on the site after one day.
kvx: ترجمو انگريزي ٿِي ٿئہ، پڻ تمي ٻِيزيون ٻوليون ۾ <strong> صلاحون </strong> پڻ زوئي هيڪو۔<strong> پروفائل </strong> آئي ڪون مانه ڪلڪ ڪرو، پسئہ <strong> سيٽنڳ </strong> لِنڪ مانه زائين اُو ٻولِي شامل ڪرو جئي تمي ٻولوہ۔ نيسئي هاوَي ڪُنڊ ۾ هيڪ لسٽ هوشي</strong> جيا نئہ <strong> ڪيِڌو زائه۔ ترجمو هيڪا ۮي ڪيڙ ويڀ سائيٽ مانه ۮيکيام آوئه۔

source: Translation of the Common Voice site happens on <strong>Pontoon</strong>.
kvx: ڪومن وائيس رو ترجمو <strong> پونَٽُونَ مانه ٿئہ</strong>۔

source: Try again by dragging your file here
kvx: ٻِي﻿زِي وار ڪوشِيش ڪرو انَ آپرئِي فائل توڻي لي آوينَ ايٿئہ راکو

source: Try uploading again
kvx: وۯي uploading ڪريا رئي ڪوشِيش ڪرو

source: Tshivenda
kvx: تِشِيويندا

source: Tunen
kvx: تونين

source: Tupuri
kvx: تُوپُورِي

source: Turkish
kvx: تُرڪِش

source: Turkmen
kvx: تُرڪمينَ

source: Tush
kvx: تُش

source: Tuvan
kvx: تُووان

source: Twi
kvx: توِي

source: Typically megabytes
kvx: گھڻو ڪرينَ ميگابائيٽ ۾ هوئہ

source: Ubykh
kvx: اُبييخ

source: Udmurt
kvx: اُدمرت

source: Ukrainian
kvx: اوڪرينِيئنَ

source: Understand contribution criteria
kvx: ڀاڳ ۮِيڌا ۿارُو معيار نئہ ۿزمو

source: Understand how to contribute and validate on the Common Voice dataset
kvx: ۿزمو جي ڪم ڪرينَ ڪومنَ وائيس ڊيٽاسيٽ ۾ شامِل ٿي هيڪون انَ اُوئا رئي تصڌِيق ڪري هيڪون

source: Understand what to look for when listening to voice clips and help make your voice recordings richer too!
kvx: آواز را clips نئ﻿ہ ۿومڀۯتون ڪئيون واتون رو کيال راکوو انَ آپرئي آواز رِي رِيڪارڊِنگ نئہ ٺِيڪ ڪريا ۿارُو مڌت ڪرو!

source: Universities, Academics and Researchers
kvx: يُونيورسٽي،تعلِيمِي ماهر ان محققِينَ

source: Upload aborted. Do you want to delete your recordings?
kvx: اپلوڊ رد ٿي ڳيوه۔ ڪِي تمي تمارئِي رِيڪارڊِنگ Delete ڪروَا ڪرو؟

source: Upload an image file
kvx: هيڪ ڦوٽُو اپلوڊ ڪرو

source: { $uploadedQuestions } of { $totalQuestions } questions collected
kvx: { $uploadedQuestions }را سوئال ڀيۯا ڪريا ڳيا

source: { $uploadedQuestions } of { $totalQuestions } questions collected. View our <guidelinesLink>Guidelines</guidelinesLink> pages to learn more about how to add questions
kvx: { $uploadedQuestions }موئين 1سوئال جمع ٿي ڳيو۔سوئال جمع ڪريا رو طرِيقو<guidelinesLink>زويا ۿارُو امارا ۮِيڌل لِنڪ مانه زائو انَ شِينکو ڪم ڪرينَ پونيون نئہ شامِل ڪروو

source: { $uploadedSentences } of { $totalSentences } sentences collected
kvx: { $uploadedSentences } رو هيڪ جُملو جمع ڪريو ڳيو

source: { $uploadedSentences } of { $totalSentences } sentences collected. Click <downloadLink>here</downloadLink> to download rejected sentences.
kvx: { $uploadedSentences } رو { $totalSentences }هيڪ جُملو جمع ڪريو ڳيو۔ Click <downloadLink> ايٿئہ<downloadLink> رد ڪرَل جُملا download ڪريا ۿارُو۔

source: Upload failed, please retry.
kvx: اپلوڊ ناڪام ٿي ڳئي ميرڀونئي ڪرينَ ٻِي﻿زي وار ڪوشِيش ڪرو۔

source: Upload <icon></icon> public domain sentences
kvx: اپلوڊ </icon><icon> عام ڊومئن را جُملا

source: Upload in progress...
kvx: اپلوٽ جارِي سئہ۔۔۔

source: Upload more sentences?
kvx: وڌارئہ جُملا اپلوڊ ڪرو؟

source: Upload of this clip keeps failing at server. Reload the page or try again later.
kvx: اي ڪِلپ سروَر مانه اپلوڊ نٿِي ٿيتو۔ پونيا نئہ وۯي نوو ڪرو ڪا ٿوڙڪِيڪ وار ڪيڙ وۯي ڪوشش ڪرو۔

source: Upload of this clip keeps failing, keep retrying?
kvx: اِيئا ڪِلپ رو اپلوڍ وار وار ﻿فيل ٿئه ريو، ڪِي وۯي ڪوشش ڪرتا ريون؟

source: Urdu
kvx: اُردو

source: Use correct grammar
kvx: سهِي گرامر رو واپراوَ ڪرو

source: Use correct spelling and grammar
kvx: اِسپيلِنگ انَ گرامر رو سهِي اِستعمال ڪرو

source: Use correct spelling and grammar.
kvx: سهِي اِملو انَ گِرامر رو اِستعمال ڪرو۔

source: Use correct spelling and punctuation
kvx: اِسپيلِنگ انَ نُڪتون رو ٺائُوڪئہ نمُونئہ واپراوَ ڪرو

source: Useful for <mark>organic speech contexts</mark> and use cases (eg, when you want speech recognition to work with people speaking unscripted and colloquially)
kvx: کاس ٻولِي را موقعا<mark>انَ اِستعمال ۿارُو ڦائيڌا واۯو سئہ</mark> زم تمي چاهو جي ٻولِي رئي اوۯکوڻ ايوون منکون ڀيۯئي ڪوم ڪرئہ جيو اِسڪِرپٽ وڳر ان عام ٻولِي ۾ وات ڪرئه۔

source: User Name
kvx: اِستعمال ڪريا واۯو رو نوم

source: Users validate the accuracy of donated clips, checking that the speaker read the sentence correctly.
kvx: واپرايا واۯا ڪِلپون رِي ڌُرستگِي رئي تصديق ڪرئہ، هائي اِِيئا وات رئي تصديق ڪرئي جي ڀڻيا واۯئہ جُملو ٺِيڪ ڀڻيو ڪا نا۔

source: Ushojo
kvx: اُوشوجو

source: Uyghur
kvx: اُوئهُور

source: Uzbek
kvx: اُزبيڪ

source: Validated Clips
kvx: تصڌِيق ڪرل ڪِلپ

source: Validated Hours
kvx: تصڌيق ٿيل ڪلاڪ
